app/controllers/short_urls_controller.rb

SELECT `short_urls`.`click_count`, `short_urls`.`short_code`, `short_urls`.`full_url`, `short_urls`.`title` FROM `short_urls` ORDER BY `short_urls`.`click_count` DESC LIMIT 100
---
  def index
    short_urls = ShortUrl.select(:click_count, :short_code, :full_url, :title).
                          order(click_count: :desc).
                          limit(100)

INSERT INTO `short_urls` (`full_url`, `created_at`, `updated_at`) VALUES ('https://google.com', '2019-09-23 17:18:03.885598', '2019-09-23 17:18:03.885598')
---
  def create
    short_url = ShortUrl.new(full_url: short_url_params[:full_url])
    short_url.short_code = short_url.short_code
    short_url.save!

SELECT `short_urls`.* FROM `short_urls` WHERE `short_urls`.`short_code` = 'nope' ORDER BY `short_urls`.`id` DESC LIMIT 1
UPDATE `short_urls` SET `short_urls`.`click_count` = 1, `short_urls`.`updated_at` = '2019-09-23 17:20:58.412905' WHERE `short_urls`.`id` = 1
---
  def show
    short_url = ShortUrl.where(short_code: short_url_params[:id]).last
    if short_url.nil?
      return render json: { message: 'Not a valid short code' }, status: :not_found
    end

    short_url.update! click_count: (short_url.click_count + 1)