app/controllers/short_urls_controller.rb

UPDATE `short_urls` SET `short_urls`.`title` = 'Google', `short_urls`.`updated_at` = '2020-08-18 10:31:48.686972' WHERE `short_urls`.`id` = 1431
---
  def create
    short_url = ShortUrl.find_or_initialize_by(full_url: short_url_params[:full_url])
    short_url.short_code = short_url.short_code
    short_url.save!