app/jobs/update_title_job.rb

SELECT `short_urls`.* FROM `short_urls` WHERE `short_urls`.`id` = 2 LIMIT 1
---
  def perform(short_url_id)
    short_url = ShortUrl.find(short_url_id)